nested-routes-going-camping/app/controllers/campgrounds_controller.rb

SELECT "campgrounds".* FROM "campgrounds"
---
  def index
    @title = "All campgrounds:"
    @campgrounds = Campground.all

SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @campground = Campground.find(params[:id])