nested-routes-going-camping/app/controllers/campers_controller.rb

SELECT "campers".* FROM "campers"
---
  def index
    if params[:campground_id]
      campground_index
    else
      @title = "All Campers:"
      @campers = Camper.all