nested-routes-going-camping/app/controllers/reviews_controller.rb

  def index
    @campground = Campground.find(params[:campground_id])
    @reviews = Review.where(campground: params[:campground_id])
---
SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."campground_id" = 65

  def new
    @review = Review.new
    @campground = Campground.find(params[:campground_id])
---
SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]

  def create
    @review = Review.new(review_params)
    @review.camper = Camper.find_or_create_by(name: params["review"]["camper"])
    @review.campground = Campground.find(params[:campground_id])
---
INSERT INTO "campers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", 2017-04-13 11:37:28 UTC], ["updated_at", 2017-04-13 11:37:28 UTC]]
INSERT INTO "reviews" ("campground_id", "camper_id", "title", "body", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["campground_id", 65], ["camper_id", 132], ["title", "New title"], ["body", "whatever whatever"], ["rating", 3], ["created_at", 2017-04-13 11:42:54 UTC], ["updated_at", 2017-04-13 11:42:54 UTC]]
SELECT  "campers".* FROM "campers" WHERE "campers"."name" = $1 LIMIT $2  [["name", ""], ["LIMIT", 1]]
SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]