nested-routes-going-camping/app/controllers/supplies_controller.rb

  def index
    if params[:camper_id]
      camper_index
    elsif params[:campground_id]
      campground_index
    else
      @title = "All Supplies:"
      @supplies = Supply.all
---
SELECT "supplies".* FROM "supplies"