nested-routes-going-camping/app/views/campsites/show.html.erb

<ul>
  <% @campground.amenities.each do |amenity| %>
---
SELECT "amenities".* FROM "amenities" INNER JOIN "campsite_amenities" ON "amenities"."id" = "campsite_amenities"."amenity_id" WHERE "campsite_amenities"."campsite_id" = $1  [["campsite_id", 5]]