nested-routes-going-camping/app/views/campgrounds/show.html.erb

<ul>
  <% @campground.amenities.each do |amenity| %>
---
SELECT "amenities".* FROM "amenities" INNER JOIN "campground_amenities" ON "amenities"."id" = "campground_amenities"."amenity_id" WHERE "campground_amenities"."campground_id" = $1  [["campground_id", 1]]


<h3>There are <%= @campground.campsites.size %> campsites at this location. Currently there are <%= @campground.campsites.where(available: true).size; %> open campsites.  </h3>
---
SELECT COUNT(*) FROM "campsites" WHERE "campsites"."campground_id" = $1 AND "campsites"."available" = $2  [["campground_id", 45], ["available", true]]

<h3>Reviews</h3>
<% if @campground.reviews.size > 0 %>
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."campground_id" = $1 ORDER BY "reviews"."id" ASC LIMIT $2  [["campground_id", 57], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."campground_id" = $1  [["campground_id", 57]]

  <p><%= @campground.reviews.first.body %></p>
  <p>By <%= @campground.reviews.first.camper.name %></p>
---
SELECT  "campers".* FROM "campers" WHERE "campers"."id" = $1 LIMIT $2  [["id", 111], ["LIMIT", 1]]